//Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
//и на выходе показывает вторую цифру этого числа.
//456 -> 5
//782 -> 8
//918 -> 1

    // int[] array = {645};

    //     int n = array.Length;
    //     int find = "1";
    //     int index = 0;
    //     while (index < 3)
    // {
    // if(array[index] == find)
    // {
    //    Console.WriteLine(index);
    // }
    // index++;
    // }

//Задача 13: Напишите программу, которая выводит третью цифру
// заданного числа или сообщает, что третьей цифры нет.
//645 -> 5
//78 -> третьей цифры нет
//32679 -> 6

//Задача 15: Напишите программу, которая принимает на вход цифру, 
//обозначающую день недели, и проверяет, является ли этот день выходным.
//6 -> да
//7 -> да
//1 -> нет